In [1]:
import pandas as pd

In [2]:
pd.read_csv('students.csv')

         Name   hw1   hw2 program
0      Dorian  10.0  10.0    MSIS
1    Jeannine   6.0   7.0    MSIS
2   Iluminada   2.0   NaN     MBA
3        Luci   7.0   7.0    MSIS
4       Jenny   8.0   NaN     NaN
5    Demetria   2.0   4.0    MSIS
6     Michael   6.0  10.0     MBA
7     Garland   9.0   1.0    MSIS
8      Shelby   1.0  10.0    MSIS
9       Mercy   5.0   6.0    MSIS
10       John   NaN  10.0    MSIS

In [3]:
type(pd.read_csv('students.csv'))

pandas.core.frame.DataFrame

In [4]:
pd.read_csv('students.csv',index_col=0)

            hw1   hw2 program
Name
Dorian     10.0  10.0    MSIS
Jeannine    6.0   7.0    MSIS
Iluminada   2.0   NaN     MBA
Luci        7.0   7.0    MSIS
Jenny       8.0   NaN     NaN
Demetria    2.0   4.0    MSIS
Michael     6.0  10.0     MBA
Garland     9.0   1.0    MSIS
Shelby      1.0  10.0    MSIS
Mercy       5.0   6.0    MSIS
John        NaN  10.0    MSIS

In [5]:
df = pd.read_csv('students.csv',index_col=0)

In [6]:
df.head()

            hw1   hw2 program
Name
Dorian     10.0  10.0    MSIS
Jeannine    6.0   7.0    MSIS
Iluminada   2.0   NaN     MBA
Luci        7.0   7.0    MSIS
Jenny       8.0   NaN     NaN

In [7]:
df.describe()

             hw1        hw2
count  10.000000   9.000000
mean    5.600000   7.222222
std     3.098387   3.192874
min     1.000000   1.000000
25%     2.750000   6.000000
50%     6.000000   7.000000
75%     7.750000  10.000000
max    10.000000  10.000000

In [8]:
df.index

Index(['Dorian', 'Jeannine', 'Iluminada', 'Luci', 'Jenny', 'Demetria',
       'Michael', 'Garland', 'Shelby', 'Mercy', 'John'],
      dtype='object', name='Name')

In [9]:
df.columns

Index(['hw1', 'hw2', 'program'], dtype='object')

In [10]:
type(df.columns)

pandas.core.indexes.base.Index

In [11]:
df.columns = ['homework1', 'hw2', 'program']

In [12]:
df.head()

           homework1   hw2 program
Name
Dorian          10.0  10.0    MSIS
Jeannine         6.0   7.0    MSIS
Iluminada        2.0   NaN     MBA
Luci             7.0   7.0    MSIS
Jenny            8.0   NaN     NaN

In [13]:
df.rename(columns={"homework1": "hw1"})

            hw1   hw2 program
Name
Dorian     10.0  10.0    MSIS
Jeannine    6.0   7.0    MSIS
Iluminada   2.0   NaN     MBA
Luci        7.0   7.0    MSIS
Jenny       8.0   NaN     NaN
Demetria    2.0   4.0    MSIS
Michael     6.0  10.0     MBA
Garland     9.0   1.0    MSIS
Shelby      1.0  10.0    MSIS
Mercy       5.0   6.0    MSIS
John        NaN  10.0    MSIS

In [14]:
df.head()

           homework1   hw2 program
Name
Dorian          10.0  10.0    MSIS
Jeannine         6.0   7.0    MSIS
Iluminada        2.0   NaN     MBA
Luci             7.0   7.0    MSIS
Jenny            8.0   NaN     NaN

In [15]:
df.rename(columns={"homework1": "hw1"},inplace=True)

In [16]:
df.head()

            hw1   hw2 program
Name
Dorian     10.0  10.0    MSIS
Jeannine    6.0   7.0    MSIS
Iluminada   2.0   NaN     MBA
Luci        7.0   7.0    MSIS
Jenny       8.0   NaN     NaN

In [17]:
df['hw1']

Name
Dorian       10.0
Jeannine      6.0
Iluminada     2.0
Luci          7.0
Jenny         8.0
Demetria      2.0
Michael       6.0
Garland       9.0
Shelby        1.0
Mercy         5.0
John          NaN
Name: hw1, dtype: float64

In [18]:
type(df['hw1'])

pandas.core.series.Series

In [19]:
df[['hw1','hw2']]

            hw1   hw2
Name
Dorian     10.0  10.0
Jeannine    6.0   7.0
Iluminada   2.0   NaN
Luci        7.0   7.0
Jenny       8.0   NaN
Demetria    2.0   4.0
Michael     6.0  10.0
Garland     9.0   1.0
Shelby      1.0  10.0
Mercy       5.0   6.0
John        NaN  10.0

In [20]:
type(df[['hw1','hw2']])

pandas.core.frame.DataFrame

In [21]:
df[['hw1']]

            hw1
Name
Dorian     10.0
Jeannine    6.0
Iluminada   2.0
Luci        7.0
Jenny       8.0
Demetria    2.0
Michael     6.0
Garland     9.0
Shelby      1.0
Mercy       5.0
John        NaN

In [22]:
type(df[['hw1']])

pandas.core.frame.DataFrame

In [23]:
df[df['program'] == 'MSIS']

           hw1   hw2 program
Name
Dorian    10.0  10.0    MSIS
Jeannine   6.0   7.0    MSIS
Luci       7.0   7.0    MSIS
Demetria   2.0   4.0    MSIS
Garland    9.0   1.0    MSIS
Shelby     1.0  10.0    MSIS
Mercy      5.0   6.0    MSIS
John       NaN  10.0    MSIS

In [24]:
df[df['program'] == 'MSIS'].mean()

hw1    5.714286
hw2    6.875000
dtype: float64

get mean of grades for each student

In [29]:
df_MSIS = df[df['program'] == 'MSIS'].copy()

In [30]:
(df_MSIS['hw1'] + df_MSIS['hw2'])/2

Name
Dorian      10.0
Jeannine     6.5
Luci         7.0
Demetria     3.0
Garland      5.0
Shelby       5.5
Mercy        5.5
John         NaN
dtype: float64

In [31]:
df_MSIS['hw_avg'] = (df_MSIS['hw1'] + df_MSIS['hw2'])/2
df_MSIS.head()

           hw1   hw2 program  hw_avg
Name
Dorian    10.0  10.0    MSIS    10.0
Jeannine   6.0   7.0    MSIS     6.5
Luci       7.0   7.0    MSIS     7.0
Demetria   2.0   4.0    MSIS     3.0
Garland    9.0   1.0    MSIS     5.0

In [45]:
hw_column_names = ['hw1','hw2']

df_MSIS[hw_column_names].mean(axis=1)

Name
Dorian      10.0
Jeannine     6.5
Luci         7.0
Demetria     3.0
Garland      5.0
Shelby       5.5
Mercy        5.5
John        10.0
dtype: float64

In [47]:
df_MSIS['hw_avg_USING .mean()'] = df_MSIS[hw_column_names].mean(axis=1)
df_MSIS

           hw1   hw2 program  hw_avg  hw1_COPY  hw_avg_USING .mean()
Name
Dorian    10.0  10.0    MSIS    10.0      10.0                  10.0
Jeannine   6.0   7.0    MSIS     6.5       6.0                   6.5
Luci       7.0   7.0    MSIS     7.0       7.0                   7.0
Demetria   2.0   4.0    MSIS     3.0       2.0                   3.0
Garland    9.0   1.0    MSIS     5.0       9.0                   5.0
Shelby     1.0  10.0    MSIS     5.5       1.0                   5.5
Mercy      5.0   6.0    MSIS     5.5       5.0                   5.5
John       NaN  10.0    MSIS     NaN       NaN                  10.0

In [48]:
df_MSIS['hw_avg'] == df_MSIS['hw_avg_USING .mean()']

Name
Dorian       True
Jeannine     True
Luci         True
Demetria     True
Garland      True
Shelby       True
Mercy        True
John        False
dtype: bool

In [51]:
(df_MSIS['hw_avg'] == df_MSIS['hw_avg_USING .mean()']).any()

True

In [52]:
(df_MSIS['hw_avg'] == df_MSIS['hw_avg_USING .mean()']).all()

False

In [53]:
not (df_MSIS['hw_avg'] == df_MSIS['hw_avg_USING .mean()']).all()

True

In [54]:
(~(df_MSIS['hw_avg'] == df_MSIS['hw_avg_USING .mean()']) ).any()

True